Prac7

ip address asinging
ospf
enable pass
line console pass
ssh on all 3 router

**ON R1

show version
router(config)# license boot module c1900 technology-package securityk9
(accepts the license)

do copy run start
exit
reload
show version
(check technnolgy license is enable or not in show version content)

router # mkdir ipsdir
router(config)# ip ips config location flash:ipsdir
router(config)# ip ips name iosips
router(config)# ip ips notify log
exit
show run
(you will get details of config)

router(config)# service timestamps log datetime msec
router(config)# logging host 192.168.1.50
router(config)# ip ips signaturecategory

(R1=router)

R1(config-ips-category)# category all
R1(config-ips-category-action)# retired true
R1(config-ips-category-action)# exit
R1(config-ips-category)# category ios_ips basic
R1(config-ips-category-action)# retired false
R1(config-ips-category-action)# exit
R1(config-ips-cateogry)# exit
Do you want to accept these changes? [confirm] <Enter>

R1(config)# interface g0/1
R1(config-if)# ip ips iosips out

(To modify the signature)
R1(config)# ip ips signature-definition
R1(config-sigdef)# signature 2004 0
R1(config-sigdef-sig)# status
R1(config-sigdef-sig-status)# retired false
R1(config-sigdef-sig-status)# enabled true
R1(config-sigdef-sig-status)# exit
R1(config-sigdef-sig)# engine
R1(config-sigdef-sig-engine)# event-action produce-alert 
R1(config-sigdefsig-engine)# event-action deny-packet-inline
R1(config-sigdef-sig-engine)# exit
R1(config-sigdef-sig)# exit
R1(config-sigdef)# exit
Do you want to accept these changes? [confirm] <Enter>

(Go to pc c)
ping 192.198.1.2
(it will time out packet lost)

(GO to pc-A)
(pc-a se pc-c ko ping)
ping 192.168.3.2
(It will work packets received)

(Go to syslog server)
a. Click the Syslog server. 
b. Select the Services tab. 
c. In the left navigation menu, select SYSLOG to view the log file.
(services will have the message)





